; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	infrared1 - mode
	spectrograph4 - mode
	thermograph3 - mode
	image5 - mode
	thermograph0 - mode
	image2 - mode
	GroundStation0 - direction
	Star1 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	Star5 - direction
	Planet6 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 Star3)
	(supports instrument1 infrared1)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 image5)
	(supports instrument2 image2)
	(supports instrument2 spectrograph4)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet6)
	(supports instrument3 spectrograph4)
	(supports instrument3 infrared1)
	(supports instrument3 image5)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 image2)
	(calibration_target instrument4 GroundStation4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
	(supports instrument5 image2)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star1)
)
(:goal (and
	(pointing satellite1 Star5)
	(have_image Star5 spectrograph4)
	(have_image Planet6 thermograph3)
	(have_image Planet6 spectrograph4)
	(have_image Star7 image2)
	(have_image Planet8 infrared1)
	(have_image Planet8 spectrograph4)
	(have_image Star9 image2)
	(have_image Star9 thermograph0)
	(have_image Star10 spectrograph4)
))

)

; plan
1. (turn_to satellite2 groundstation2 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 groundstation2)
   goals met: 0 of 10
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 10
3. (calibrate satellite2 instrument5 groundstation2)
   added: (calibrated instrument5)
   goals met: 0 of 10
4. (turn_to satellite2 star9 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 star9)
   goals met: 0 of 10
5. (take_image satellite2 star9 instrument5 image2)
   added: (have_image star9 image2)
   goals met: 1 of 10
6. (turn_to satellite2 star7 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 star7)
   goals met: 1 of 10
7. (turn_to satellite1 groundstation4 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 groundstation4)
   goals met: 1 of 10
8. (turn_to satellite0 groundstation4 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 groundstation4)
   goals met: 1 of 10
9. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 10
10. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 10
11. (calibrate satellite1 instrument3 groundstation4)
   added: (calibrated instrument3)
   goals met: 1 of 10
12. (calibrate satellite0 instrument1 groundstation4)
   added: (calibrated instrument1)
   goals met: 1 of 10
13. (take_image satellite2 star7 instrument5 image2)
   added: (have_image star7 image2)
   goals met: 2 of 10
14. (turn_to satellite0 planet6 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 planet6)
   goals met: 2 of 10
15. (take_image satellite0 planet6 instrument1 thermograph3)
   added: (have_image planet6 thermograph3)
   goals met: 3 of 10
16. (turn_to satellite0 star9 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star9)
   goals met: 3 of 10
17. (take_image satellite0 star9 instrument1 thermograph0)
   added: (have_image star9 thermograph0)
   goals met: 4 of 10
18. (turn_to satellite1 planet6 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 planet6)
   goals met: 4 of 10
19. (take_image satellite1 planet6 instrument3 spectrograph4)
   added: (have_image planet6 spectrograph4)
   goals met: 5 of 10
20. (turn_to satellite1 planet8 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 planet8)
   goals met: 5 of 10
21. (take_image satellite1 planet8 instrument3 infrared1)
   added: (have_image planet8 infrared1)
   goals met: 6 of 10
22. (take_image satellite1 planet8 instrument3 spectrograph4)
   added: (have_image planet8 spectrograph4)
   goals met: 7 of 10
23. (turn_to satellite1 star10 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star10)
   goals met: 7 of 10
24. (take_image satellite1 star10 instrument3 spectrograph4)
   added: (have_image star10 spectrograph4)
   goals met: 8 of 10
25. (turn_to satellite1 star5 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star5)
   goals met: 9 of 10
26. (take_image satellite1 star5 instrument3 spectrograph4)
   added: (have_image star5 spectrograph4)
   goals met: 10 of 10
